{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "describe_psoriasis",
    "1": "greet",
    "2": "goodbye",
    "3": "affirm",
    "4": "deny"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "affirm": 3,
    "deny": 4,
    "describe_psoriasis": 0,
    "goodbye": 2,
    "greet": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
